app/controllers/business_types_controller.rb

SELECT "business_types".* FROM "business_types"
---
  def index
    @business_types = BusinessType.all