app/controllers/district_areas_controller.rb

  def index
    @district_areas = DistrictArea.all
---
SELECT "district_areas".* FROM "district_areas"