app/controllers/upzs_controller.rb

SELECT "upzs".* FROM "upzs"
---
  def index
    @upzs = Upz.all